# Напишите программу, которая принимает на вход цифру, обозначающую день недели
# и проверяет, является ли этот день выходным.
# Пример:
# o 6 -> да
# o 7 -> да
# o 1 -> нет
print('Введите цифру')
num = input()

